var ErrorList = {
    _errorList:{
        0:"ErrorId未更新",

        100000:"mysql 错误",
        100001:"redis 错误",
        100002:"tiken 无效",
        100003:"uid 错误",

        200000:"方法调用发生运行时错误",
        200001:"服务器错误",
        200002:"解析请求数据错误",
        200003:"解析Requst结构错误",

        300000:"已经在匹配中",
        300001:"取消匹配失败",
        300002:"已经加入战斗,无法取消匹配",

        400000:"解析房间数错误",
        400001:"解析房间数错误",
        400002:"初始化战斗数据失败",
        400003:"房间不存在",
        400004:"玩家不属于这个房间",
        400005:"玩家还未JoinRoom",
        400006:"该房间战斗已结束",
        400007:"战斗还未开始",

        410000:"玩家当前不可以行动",
        410001:"食物不足",
        410002:"骰子数量不正确",
        410003:"地块不存在",
        410004:"不可以掷骰子",
        410005:"没有更多的步数了,不能选择岔路",

        500000:"用户名或密码为空",
        500001:"用户名密码错误",
        500002:"获取逻辑服务器地址失败",
    },

    errorShow: function(_error) {
        if(this._errorList[_error] === undefined) {
            _error = 0;
        }
        return this._errorList[_error]
    }
};

module.exports = ErrorList;